jayalcock/Clocks/1768 LPCOpen/1768 LPCOpen THUMB RAM Debug/cr_startup_lpc175x_6x.asm
	.cpu cortex-m3
	.eabi_attribute 20, 1
	.eabi_attribute 21, 1
	.eabi_attribute 23, 3
	.eabi_attribute 24, 1
	.eabi_attribute 25, 1
	.eabi_attribute 26, 1
	.eabi_attribute 30, 6
	.eabi_attribute 34, 1
	.eabi_attribute 18, 4
	.file	"cr_startup_lpc175x_6x.c"
	.text
.Ltext0:
	.global	g_pfnVectors
	.section	.isr_vector,"a"
	.align	2
	.type	g_pfnVectors, %object
	.size	g_pfnVectors, 204
g_pfnVectors:
	.word	_vStackTop
	.word	ResetISR
	.word	NMI_Handler
	.word	HardFault_Handler
	.word	MemManage_Handler
	.word	BusFault_Handler
	.word	UsageFault_Handler
	.word	__valid_user_code_checksum
	.word	0
	.word	0
	.word	0
	.word	SVC_Handler
	.word	DebugMon_Handler
	.word	0
	.word	PendSV_Handler
	.word	SysTick_Handler
	.word	WDT_IRQHandler
	.word	TIMER0_IRQHandler
	.word	TIMER1_IRQHandler
	.word	TIMER2_IRQHandler
	.word	TIMER3_IRQHandler
	.word	UART0_IRQHandler
	.word	UART1_IRQHandler
	.word	UART2_IRQHandler
	.word	UART3_IRQHandler
	.word	PWM1_IRQHandler
	.word	I2C0_IRQHandler
	.word	I2C1_IRQHandler
	.word	I2C2_IRQHandler
	.word	SPI_IRQHandler
	.word	SSP0_IRQHandler
	.word	SSP1_IRQHandler
	.word	PLL0_IRQHandler
	.word	RTC_IRQHandler
	.word	EINT0_IRQHandler
	.word	EINT1_IRQHandler
	.word	EINT2_IRQHandler
	.word	EINT3_IRQHandler
	.word	ADC_IRQHandler
	.word	BOD_IRQHandler
	.word	USB_IRQHandler
	.word	CAN_IRQHandler
	.word	DMA_IRQHandler
	.word	I2S_IRQHandler
	.word	ETH_IRQHandler
	.word	RIT_IRQHandler
	.word	MCPWM_IRQHandler
	.word	QEI_IRQHandler
	.word	PLL1_IRQHandler
	.word	USBActivity_IRQHandler
	.word	CANActivity_IRQHandler
	.section	.after_vectors,"ax",%progbits
	.align	1
	.global	data_init
	.syntax unified
	.thumb
	.thumb_func
	.fpu softvfp
	.type	data_init, %function
data_init:
.LFB0:
	.file 1 "/Users/jayalcock/Projects/Clocks/Clocks/1768 LPCOpen/src/cr_startup_lpc175x_6x.c"
	.loc 1 222 77
	@ args = 0, pretend = 0, frame = 32
	@ frame_needed = 0, uses_anonymous_args = 0
	@ link register save eliminated.
	sub	sp, sp, #32
.LCFI0:
	str	r0, [sp, #12]
	str	r1, [sp, #8]
	str	r2, [sp, #4]
	.loc 1 223 19
	ldr	r3, [sp, #8]
	str	r3, [sp, #28]
	.loc 1 224 19
	ldr	r3, [sp, #12]
	str	r3, [sp, #24]
	.loc 1 226 15
	movs	r3, #0
	str	r3, [sp, #20]
	.loc 1 226 5
	b	.L2
.L3:
	.loc 1 227 29 discriminator 3
	ldr	r2, [sp, #24]
	adds	r3, r2, #4
	str	r3, [sp, #24]
	.loc 1 227 17 discriminator 3
	ldr	r3, [sp, #28]
	adds	r1, r3, #4
	str	r1, [sp, #28]
	.loc 1 227 22 discriminator 3
	ldr	r2, [r2]
	.loc 1 227 20 discriminator 3
	str	r2, [r3]
	.loc 1 226 37 discriminator 3
	ldr	r3, [sp, #20]
	adds	r3, r3, #4
	str	r3, [sp, #20]
.L2:
	.loc 1 226 5 discriminator 1
	ldr	r2, [sp, #20]
	ldr	r3, [sp, #4]
	cmp	r2, r3
	bcc	.L3
	.loc 1 228 1
	nop
	nop
	add	sp, sp, #32
.LCFI1:
	@ sp needed
	bx	lr
.LFE0:
	.size	data_init, .-data_init
	.align	1
	.global	bss_init
	.syntax unified
	.thumb
	.thumb_func
	.fpu softvfp
	.type	bss_init, %function
bss_init:
.LFB1:
	.loc 1 231 53
	@ args = 0, pretend = 0, frame = 16
	@ frame_needed = 0, uses_anonymous_args = 0
	@ link register save eliminated.
	sub	sp, sp, #16
.LCFI2:
	str	r0, [sp, #4]
	str	r1, [sp]
	.loc 1 232 19
	ldr	r3, [sp, #4]
	str	r3, [sp, #12]
	.loc 1 234 15
	movs	r3, #0
	str	r3, [sp, #8]
	.loc 1 234 5
	b	.L5
.L6:
	.loc 1 235 17 discriminator 3
	ldr	r3, [sp, #12]
	adds	r2, r3, #4
	str	r2, [sp, #12]
	.loc 1 235 20 discriminator 3
	movs	r2, #0
	str	r2, [r3]
	.loc 1 234 37 discriminator 3
	ldr	r3, [sp, #8]
	adds	r3, r3, #4
	str	r3, [sp, #8]
.L5:
	.loc 1 234 5 discriminator 1
	ldr	r2, [sp, #8]
	ldr	r3, [sp]
	cmp	r2, r3
	bcc	.L6
	.loc 1 236 1
	nop
	nop
	add	sp, sp, #16
.LCFI3:
	@ sp needed
	bx	lr
.LFE1:
	.size	bss_init, .-bss_init
	.align	1
	.global	ResetISR
	.syntax unified
	.thumb
	.thumb_func
	.fpu softvfp
	.type	ResetISR, %function
ResetISR:
.LFB2:
	.loc 1 257 16
	@ args = 0, pretend = 0, frame = 16
	@ frame_needed = 0, uses_anonymous_args = 0
	push	{lr}
.LCFI4:
	sub	sp, sp, #20
.LCFI5:
	.loc 1 266 22
	ldr	r3, .L13
	str	r3, [sp, #12]
	.loc 1 269 11
	b	.L8
.L9:
	.loc 1 270 37
	ldr	r3, [sp, #12]
	adds	r2, r3, #4
	str	r2, [sp, #12]
	.loc 1 270 18
	ldr	r3, [r3]
	str	r3, [sp]
	.loc 1 271 36
	ldr	r3, [sp, #12]
	adds	r2, r3, #4
	str	r2, [sp, #12]
	.loc 1 271 17
	ldr	r3, [r3]
	str	r3, [sp, #8]
	.loc 1 272 39
	ldr	r3, [sp, #12]
	adds	r2, r3, #4
	str	r2, [sp, #12]
	.loc 1 272 20
	ldr	r3, [r3]
	str	r3, [sp, #4]
	.loc 1 273 9
	ldr	r2, [sp, #4]
	ldr	r1, [sp, #8]
	ldr	r0, [sp]
	bl	data_init
.L8:
	.loc 1 269 11
	ldr	r3, [sp, #12]
	ldr	r2, .L13+4
	cmp	r3, r2
	bcc	.L9
	.loc 1 277 11
	b	.L10
.L11:
	.loc 1 278 36
	ldr	r3, [sp, #12]
	adds	r2, r3, #4
	str	r2, [sp, #12]
	.loc 1 278 17
	ldr	r3, [r3]
	str	r3, [sp, #8]
	.loc 1 279 39
	ldr	r3, [sp, #12]
	adds	r2, r3, #4
	str	r2, [sp, #12]
	.loc 1 279 20
	ldr	r3, [r3]
	str	r3, [sp, #4]
	.loc 1 280 9
	ldr	r1, [sp, #4]
	ldr	r0, [sp, #8]
	bl	bss_init
.L10:
	.loc 1 277 11
	ldr	r3, [sp, #12]
	ldr	r2, .L13+8
	cmp	r3, r2
	bcc	.L11
	.loc 1 284 5
	bl	SystemInit
	.loc 1 298 5
	bl	main
.L12:
	.loc 1 304 11 discriminator 1
	b	.L12
.L14:
	.align	2
.L13:
	.word	__data_section_table
	.word	__data_section_table_end
	.word	__bss_section_table_end
.LFE2:
	.size	ResetISR, .-ResetISR
	.align	1
	.weak	NMI_Handler
	.syntax unified
	.thumb
	.thumb_func
	.fpu softvfp
	.type	NMI_Handler, %function
NMI_Handler:
.LFB3:
	.loc 1 315 1
	@ args = 0, pretend = 0, frame = 0
	@ frame_needed = 0, uses_anonymous_args = 0
	@ link register save eliminated.
.L16:
	.loc 1 315 8 discriminator 1
	b	.L16
.LFE3:
	.size	NMI_Handler, .-NMI_Handler
	.align	1
	.weak	HardFault_Handler
	.syntax unified
	.thumb
	.thumb_func
	.fpu softvfp
	.type	HardFault_Handler, %function
HardFault_Handler:
.LFB4:
	.loc 1 320 1
	@ args = 0, pretend = 0, frame = 0
	@ frame_needed = 0, uses_anonymous_args = 0
	@ link register save eliminated.
.L18:
	.loc 1 320 8 discriminator 1
	b	.L18
.LFE4:
	.size	HardFault_Handler, .-HardFault_Handler
	.align	1
	.weak	MemManage_Handler
	.syntax unified
	.thumb
	.thumb_func
	.fpu softvfp
	.type	MemManage_Handler, %function
MemManage_Handler:
.LFB5:
	.loc 1 325 1
	@ args = 0, pretend = 0, frame = 0
	@ frame_needed = 0, uses_anonymous_args = 0
	@ link register save eliminated.
.L20:
	.loc 1 325 8 discriminator 1
	b	.L20
.LFE5:
	.size	MemManage_Handler, .-MemManage_Handler
	.align	1
	.weak	BusFault_Handler
	.syntax unified
	.thumb
	.thumb_func
	.fpu softvfp
	.type	BusFault_Handler, %function
BusFault_Handler:
.LFB6:
	.loc 1 330 1
	@ args = 0, pretend = 0, frame = 0
	@ frame_needed = 0, uses_anonymous_args = 0
	@ link register save eliminated.
.L22:
	.loc 1 330 8 discriminator 1
	b	.L22
.LFE6:
	.size	BusFault_Handler, .-BusFault_Handler
	.align	1
	.weak	UsageFault_Handler
	.syntax unified
	.thumb
	.thumb_func
	.fpu softvfp
	.type	UsageFault_Handler, %function
UsageFault_Handler:
.LFB7:
	.loc 1 335 1
	@ args = 0, pretend = 0, frame = 0
	@ frame_needed = 0, uses_anonymous_args = 0
	@ link register save eliminated.
.L24:
	.loc 1 335 8 discriminator 1
	b	.L24
.LFE7:
	.size	UsageFault_Handler, .-UsageFault_Handler
	.align	1
	.weak	SVC_Handler
	.syntax unified
	.thumb
	.thumb_func
	.fpu softvfp
	.type	SVC_Handler, %function
SVC_Handler:
.LFB8:
	.loc 1 340 1
	@ args = 0, pretend = 0, frame = 0
	@ frame_needed = 0, uses_anonymous_args = 0
	@ link register save eliminated.
.L26:
	.loc 1 340 8 discriminator 1
	b	.L26
.LFE8:
	.size	SVC_Handler, .-SVC_Handler
	.align	1
	.weak	DebugMon_Handler
	.syntax unified
	.thumb
	.thumb_func
	.fpu softvfp
	.type	DebugMon_Handler, %function
DebugMon_Handler:
.LFB9:
	.loc 1 345 1
	@ args = 0, pretend = 0, frame = 0
	@ frame_needed = 0, uses_anonymous_args = 0
	@ link register save eliminated.
.L28:
	.loc 1 345 8 discriminator 1
	b	.L28
.LFE9:
	.size	DebugMon_Handler, .-DebugMon_Handler
	.align	1
	.weak	PendSV_Handler
	.syntax unified
	.thumb
	.thumb_func
	.fpu softvfp
	.type	PendSV_Handler, %function
PendSV_Handler:
.LFB10:
	.loc 1 350 1
	@ args = 0, pretend = 0, frame = 0
	@ frame_needed = 0, uses_anonymous_args = 0
	@ link register save eliminated.
.L30:
	.loc 1 350 8 discriminator 1
	b	.L30
.LFE10:
	.size	PendSV_Handler, .-PendSV_Handler
	.align	1
	.weak	SysTick_Handler
	.syntax unified
	.thumb
	.thumb_func
	.fpu softvfp
	.type	SysTick_Handler, %function
SysTick_Handler:
.LFB11:
	.loc 1 355 1
	@ args = 0, pretend = 0, frame = 0
	@ frame_needed = 0, uses_anonymous_args = 0
	@ link register save eliminated.
.L32:
	.loc 1 355 8 discriminator 1
	b	.L32
.LFE11:
	.size	SysTick_Handler, .-SysTick_Handler
	.align	1
	.weak	IntDefaultHandler
	.syntax unified
	.thumb
	.thumb_func
	.fpu softvfp
	.type	IntDefaultHandler, %function
IntDefaultHandler:
.LFB12:
	.loc 1 366 1
	@ args = 0, pretend = 0, frame = 0
	@ frame_needed = 0, uses_anonymous_args = 0
	@ link register save eliminated.
.L34:
	.loc 1 366 8 discriminator 1
	b	.L34
.LFE12:
	.size	IntDefaultHandler, .-IntDefaultHandler
	.weak	CANActivity_IRQHandler
	.thumb_set CANActivity_IRQHandler,IntDefaultHandler
	.weak	USBActivity_IRQHandler
	.thumb_set USBActivity_IRQHandler,IntDefaultHandler
	.weak	PLL1_IRQHandler
	.thumb_set PLL1_IRQHandler,IntDefaultHandler
	.weak	QEI_IRQHandler
	.thumb_set QEI_IRQHandler,IntDefaultHandler
	.weak	MCPWM_IRQHandler
	.thumb_set MCPWM_IRQHandler,IntDefaultHandler
	.weak	RIT_IRQHandler
	.thumb_set RIT_IRQHandler,IntDefaultHandler
	.weak	ETH_IRQHandler
	.thumb_set ETH_IRQHandler,IntDefaultHandler
	.weak	I2S_IRQHandler
	.thumb_set I2S_IRQHandler,IntDefaultHandler
	.weak	DMA_IRQHandler
	.thumb_set DMA_IRQHandler,IntDefaultHandler
	.weak	CAN_IRQHandler
	.thumb_set CAN_IRQHandler,IntDefaultHandler
	.weak	USB_IRQHandler
	.thumb_set USB_IRQHandler,IntDefaultHandler
	.weak	BOD_IRQHandler
	.thumb_set BOD_IRQHandler,IntDefaultHandler
	.weak	ADC_IRQHandler
	.thumb_set ADC_IRQHandler,IntDefaultHandler
	.weak	EINT3_IRQHandler
	.thumb_set EINT3_IRQHandler,IntDefaultHandler
	.weak	EINT2_IRQHandler
	.thumb_set EINT2_IRQHandler,IntDefaultHandler
	.weak	EINT1_IRQHandler
	.thumb_set EINT1_IRQHandler,IntDefaultHandler
	.weak	EINT0_IRQHandler
	.thumb_set EINT0_IRQHandler,IntDefaultHandler
	.weak	RTC_IRQHandler
	.thumb_set RTC_IRQHandler,IntDefaultHandler
	.weak	PLL0_IRQHandler
	.thumb_set PLL0_IRQHandler,IntDefaultHandler
	.weak	SSP1_IRQHandler
	.thumb_set SSP1_IRQHandler,IntDefaultHandler
	.weak	SSP0_IRQHandler
	.thumb_set SSP0_IRQHandler,IntDefaultHandler
	.weak	SPI_IRQHandler
	.thumb_set SPI_IRQHandler,IntDefaultHandler
	.weak	I2C2_IRQHandler
	.thumb_set I2C2_IRQHandler,IntDefaultHandler
	.weak	I2C1_IRQHandler
	.thumb_set I2C1_IRQHandler,IntDefaultHandler
	.weak	I2C0_IRQHandler
	.thumb_set I2C0_IRQHandler,IntDefaultHandler
	.weak	PWM1_IRQHandler
	.thumb_set PWM1_IRQHandler,IntDefaultHandler
	.weak	UART3_IRQHandler
	.thumb_set UART3_IRQHandler,IntDefaultHandler
	.weak	UART2_IRQHandler
	.thumb_set UART2_IRQHandler,IntDefaultHandler
	.weak	UART1_IRQHandler
	.thumb_set UART1_IRQHandler,IntDefaultHandler
	.weak	UART0_IRQHandler
	.thumb_set UART0_IRQHandler,IntDefaultHandler
	.weak	TIMER3_IRQHandler
	.thumb_set TIMER3_IRQHandler,IntDefaultHandler
	.weak	TIMER2_IRQHandler
	.thumb_set TIMER2_IRQHandler,IntDefaultHandler
	.weak	TIMER1_IRQHandler
	.thumb_set TIMER1_IRQHandler,IntDefaultHandler
	.weak	TIMER0_IRQHandler
	.thumb_set TIMER0_IRQHandler,IntDefaultHandler
	.weak	WDT_IRQHandler
	.thumb_set WDT_IRQHandler,IntDefaultHandler
	.weak	__valid_user_code_checksum
	.section	.debug_frame,"",%progbits
.Lframe0:
	.4byte	.LECIE0-.LSCIE0
.LSCIE0:
	.4byte	0xffffffff
	.byte	0x3
	.ascii	"\000"
	.uleb128 0x1
	.sleb128 -4
	.uleb128 0xe
	.byte	0xc
	.uleb128 0xd
	.uleb128 0
	.align	2
.LECIE0:
.LSFDE0:
	.4byte	.LEFDE0-.LASFDE0
.LASFDE0:
	.4byte	.Lframe0
	.4byte	.LFB0
	.4byte	.LFE0-.LFB0
	.byte	0x4
	.4byte	.LCFI0-.LFB0
	.byte	0xe
	.uleb128 0x20
	.byte	0x4
	.4byte	.LCFI1-.LCFI0
	.byte	0xe
	.uleb128 0
	.align	2
.LEFDE0:
.LSFDE2:
	.4byte	.LEFDE2-.LASFDE2
.LASFDE2:
	.4byte	.Lframe0
	.4byte	.LFB1
	.4byte	.LFE1-.LFB1
	.byte	0x4
	.4byte	.LCFI2-.LFB1
	.byte	0xe
	.uleb128 0x10
	.byte	0x4
	.4byte	.LCFI3-.LCFI2
	.byte	0xe
	.uleb128 0
	.align	2
.LEFDE2:
.LSFDE4:
	.4byte	.LEFDE4-.LASFDE4
.LASFDE4:
	.4byte	.Lframe0
	.4byte	.LFB2
	.4byte	.LFE2-.LFB2
	.byte	0x4
	.4byte	.LCFI4-.LFB2
	.byte	0xe
	.uleb128 0x4
	.byte	0x8e
	.uleb128 0x1
	.byte	0x4
	.4byte	.LCFI5-.LCFI4
	.byte	0xe
	.uleb128 0x18
	.align	2
.LEFDE4:
.LSFDE6:
	.4byte	.LEFDE6-.LASFDE6
.LASFDE6:
	.4byte	.Lframe0
	.4byte	.LFB3
	.4byte	.LFE3-.LFB3
	.align	2
.LEFDE6:
.LSFDE8:
	.4byte	.LEFDE8-.LASFDE8
.LASFDE8:
	.4byte	.Lframe0
	.4byte	.LFB4
	.4byte	.LFE4-.LFB4
	.align	2
.LEFDE8:
.LSFDE10:
	.4byte	.LEFDE10-.LASFDE10
.LASFDE10:
	.4byte	.Lframe0
	.4byte	.LFB5
	.4byte	.LFE5-.LFB5
	.align	2
.LEFDE10:
.LSFDE12:
	.4byte	.LEFDE12-.LASFDE12
.LASFDE12:
	.4byte	.Lframe0
	.4byte	.LFB6
	.4byte	.LFE6-.LFB6
	.align	2
.LEFDE12:
.LSFDE14:
	.4byte	.LEFDE14-.LASFDE14
.LASFDE14:
	.4byte	.Lframe0
	.4byte	.LFB7
	.4byte	.LFE7-.LFB7
	.align	2
.LEFDE14:
.LSFDE16:
	.4byte	.LEFDE16-.LASFDE16
.LASFDE16:
	.4byte	.Lframe0
	.4byte	.LFB8
	.4byte	.LFE8-.LFB8
	.align	2
.LEFDE16:
.LSFDE18:
	.4byte	.LEFDE18-.LASFDE18
.LASFDE18:
	.4byte	.Lframe0
	.4byte	.LFB9
	.4byte	.LFE9-.LFB9
	.align	2
.LEFDE18:
.LSFDE20:
	.4byte	.LEFDE20-.LASFDE20
.LASFDE20:
	.4byte	.Lframe0
	.4byte	.LFB10
	.4byte	.LFE10-.LFB10
	.align	2
.LEFDE20:
.LSFDE22:
	.4byte	.LEFDE22-.LASFDE22
.LASFDE22:
	.4byte	.Lframe0
	.4byte	.LFB11
	.4byte	.LFE11-.LFB11
	.align	2
.LEFDE22:
.LSFDE24:
	.4byte	.LEFDE24-.LASFDE24
.LASFDE24:
	.4byte	.Lframe0
	.4byte	.LFB12
	.4byte	.LFE12-.LFB12
	.align	2
.LEFDE24:
	.text
.Letext0:
	.section	.debug_info,"",%progbits
.Ldebug_info0:
	.4byte	0x27b
	.2byte	0x4
	.4byte	.Ldebug_abbrev0
	.byte	0x4
	.uleb128 0x1
	.4byte	.LASF482
	.byte	0xc
	.4byte	.LASF483
	.4byte	.LASF484
	.4byte	.Ldebug_ranges0+0
	.4byte	0
	.4byte	.Ldebug_line0
	.4byte	.Ldebug_macro0
	.uleb128 0x2
	.4byte	0x3f
	.4byte	0x34
	.uleb128 0x3
	.byte	0
	.uleb128 0x4
	.4byte	0x29
	.uleb128 0x5
	.byte	0x4
	.4byte	0x44
	.uleb128 0x4
	.4byte	0x39
	.uleb128 0x6
	.uleb128 0x7
	.4byte	.LASF457
	.byte	0x1
	.byte	0x98
	.byte	0x16
	.4byte	0x34
	.uleb128 0x2
	.4byte	0x3f
	.4byte	0x61
	.uleb128 0x8
	.4byte	0x66
	.byte	0x32
	.byte	0
	.uleb128 0x4
	.4byte	0x51
	.uleb128 0x9
	.byte	0x4
	.byte	0x7
	.4byte	.LASF485
	.uleb128 0xa
	.4byte	0x45
	.byte	0x9a
	.byte	0xf
	.4byte	0x61
	.uleb128 0x5
	.byte	0x3
	.4byte	g_pfnVectors
	.uleb128 0x7
	.4byte	.LASF458
	.byte	0x1
	.byte	0xf5
	.byte	0x15
	.4byte	0x66
	.uleb128 0x7
	.4byte	.LASF459
	.byte	0x1
	.byte	0xf6
	.byte	0x15
	.4byte	0x66
	.uleb128 0x7
	.4byte	.LASF460
	.byte	0x1
	.byte	0xf8
	.byte	0x15
	.4byte	0x66
	.uleb128 0xb
	.4byte	.LASF461
	.byte	0x1
	.2byte	0x16d
	.byte	0x6
	.4byte	.LFB12
	.4byte	.LFE12-.LFB12
	.uleb128 0x1
	.byte	0x9c
	.uleb128 0xb
	.4byte	.LASF462
	.byte	0x1
	.2byte	0x162
	.byte	0x6
	.4byte	.LFB11
	.4byte	.LFE11-.LFB11
	.uleb128 0x1
	.byte	0x9c
	.uleb128 0xb
	.4byte	.LASF463
	.byte	0x1
	.2byte	0x15d
	.byte	0x6
	.4byte	.LFB10
	.4byte	.LFE10-.LFB10
	.uleb128 0x1
	.byte	0x9c
	.uleb128 0xb
	.4byte	.LASF464
	.byte	0x1
	.2byte	0x158
	.byte	0x6
	.4byte	.LFB9
	.4byte	.LFE9-.LFB9
	.uleb128 0x1
	.byte	0x9c
	.uleb128 0xb
	.4byte	.LASF465
	.byte	0x1
	.2byte	0x153
	.byte	0x6
	.4byte	.LFB8
	.4byte	.LFE8-.LFB8
	.uleb128 0x1
	.byte	0x9c
	.uleb128 0xb
	.4byte	.LASF466
	.byte	0x1
	.2byte	0x14e
	.byte	0x6
	.4byte	.LFB7
	.4byte	.LFE7-.LFB7
	.uleb128 0x1
	.byte	0x9c
	.uleb128 0xb
	.4byte	.LASF467
	.byte	0x1
	.2byte	0x149
	.byte	0x6
	.4byte	.LFB6
	.4byte	.LFE6-.LFB6
	.uleb128 0x1
	.byte	0x9c
	.uleb128 0xb
	.4byte	.LASF468
	.byte	0x1
	.2byte	0x144
	.byte	0x6
	.4byte	.LFB5
	.4byte	.LFE5-.LFB5
	.uleb128 0x1
	.byte	0x9c
	.uleb128 0xb
	.4byte	.LASF469
	.byte	0x1
	.2byte	0x13f
	.byte	0x6
	.4byte	.LFB4
	.4byte	.LFE4-.LFB4
	.uleb128 0x1
	.byte	0x9c
	.uleb128 0xb
	.4byte	.LASF470
	.byte	0x1
	.2byte	0x13a
	.byte	0x6
	.4byte	.LFB3
	.4byte	.LFE3-.LFB3
	.uleb128 0x1
	.byte	0x9c
	.uleb128 0xc
	.4byte	.LASF475
	.byte	0x1
	.2byte	0x101
	.byte	0x1
	.4byte	.LFB2
	.4byte	.LFE2-.LFB2
	.uleb128 0x1
	.byte	0x9c
	.4byte	0x1b8
	.uleb128 0xd
	.4byte	.LASF471
	.byte	0x1
	.2byte	0x106
	.byte	0x12
	.4byte	0x66
	.uleb128 0x2
	.byte	0x91
	.sleb128 -24
	.uleb128 0xd
	.4byte	.LASF472
	.byte	0x1
	.2byte	0x106
	.byte	0x1c
	.4byte	0x66
	.uleb128 0x2
	.byte	0x91
	.sleb128 -16
	.uleb128 0xd
	.4byte	.LASF473
	.byte	0x1
	.2byte	0x106
	.byte	0x25
	.4byte	0x66
	.uleb128 0x2
	.byte	0x91
	.sleb128 -20
	.uleb128 0xd
	.4byte	.LASF474
	.byte	0x1
	.2byte	0x107
	.byte	0x13
	.4byte	0x1b8
	.uleb128 0x2
	.byte	0x91
	.sleb128 -12
	.byte	0
	.uleb128 0x5
	.byte	0x4
	.4byte	0x66
	.uleb128 0xe
	.4byte	.LASF476
	.byte	0x1
	.byte	0xe7
	.byte	0x6
	.4byte	.LFB1
	.4byte	.LFE1-.LFB1
	.uleb128 0x1
	.byte	0x9c
	.4byte	0x211
	.uleb128 0xf
	.4byte	.LASF477
	.byte	0x1
	.byte	0xe7
	.byte	0x1c
	.4byte	0x66
	.uleb128 0x2
	.byte	0x91
	.sleb128 -12
	.uleb128 0x10
	.ascii	"len\000"
	.byte	0x1
	.byte	0xe7
	.byte	0x30
	.4byte	0x66
	.uleb128 0x2
	.byte	0x91
	.sleb128 -16
	.uleb128 0x11
	.4byte	.LASF478
	.byte	0x1
	.byte	0xe8
	.byte	0x13
	.4byte	0x1b8
	.uleb128 0x2
	.byte	0x91
	.sleb128 -4
	.uleb128 0x11
	.4byte	.LASF479
	.byte	0x1
	.byte	0xe9
	.byte	0x12
	.4byte	0x66
	.uleb128 0x2
	.byte	0x91
	.sleb128 -8
	.byte	0
	.uleb128 0x12
	.4byte	.LASF486
	.byte	0x1
	.byte	0xde
	.byte	0x6
	.4byte	.LFB0
	.4byte	.LFE0-.LFB0
	.uleb128 0x1
	.byte	0x9c
	.uleb128 0xf
	.4byte	.LASF480
	.byte	0x1
	.byte	0xde
	.byte	0x1d
	.4byte	0x66
	.uleb128 0x2
	.byte	0x91
	.sleb128 -20
	.uleb128 0xf
	.4byte	.LASF477
	.byte	0x1
	.byte	0xde
	.byte	0x34
	.4byte	0x66
	.uleb128 0x2
	.byte	0x91
	.sleb128 -24
	.uleb128 0x10
	.ascii	"len\000"
	.byte	0x1
	.byte	0xde
	.byte	0x48
	.4byte	0x66
	.uleb128 0x2
	.byte	0x91
	.sleb128 -28
	.uleb128 0x11
	.4byte	.LASF478
	.byte	0x1
	.byte	0xdf
	.byte	0x13
	.4byte	0x1b8
	.uleb128 0x2
	.byte	0x91
	.sleb128 -4
	.uleb128 0x11
	.4byte	.LASF481
	.byte	0x1
	.byte	0xe0
	.byte	0x13
	.4byte	0x1b8
	.uleb128 0x2
	.byte	0x91
	.sleb128 -8
	.uleb128 0x11
	.4byte	.LASF479
	.byte	0x1
	.byte	0xe1
	.byte	0x12
	.4byte	0x66
	.uleb128 0x2
	.byte	0x91
	.sleb128 -12
	.byte	0
	.byte	0
	.section	.debug_abbrev,"",%progbits
.Ldebug_abbrev0:
	.uleb128 0x1
	.uleb128 0x11
	.byte	0x1
	.uleb128 0x25
	.uleb128 0xe
	.uleb128 0x13
	.uleb128 0xb
	.uleb128 0x3
	.uleb128 0xe
	.uleb128 0x1b
	.uleb128 0xe
	.uleb128 0x2134
	.uleb128 0x19
	.uleb128 0x55
	.uleb128 0x17
	.uleb128 0x11
	.uleb128 0x1
	.uleb128 0x10
	.uleb128 0x17
	.uleb128 0x2119
	.uleb128 0x17
	.byte	0
	.byte	0
	.uleb128 0x2
	.uleb128 0x1
	.byte	0x1
	.uleb128 0x49
	.uleb128 0x13
	.uleb128 0x1
	.uleb128 0x13
	.byte	0
	.byte	0
	.uleb128 0x3
	.uleb128 0x21
	.byte	0
	.byte	0
	.byte	0
	.uleb128 0x4
	.uleb128 0x26
	.byte	0
	.uleb128 0x49
	.uleb128 0x13
	.byte	0
	.byte	0
	.uleb128 0x5
	.uleb128 0xf
	.byte	0
	.uleb128 0xb
	.uleb128 0xb
	.uleb128 0x49
	.uleb128 0x13
	.byte	0
	.byte	0
	.uleb128 0x6
	.uleb128 0x15
	.byte	0
	.uleb128 0x27
	.uleb128 0x19
	.byte	0
	.byte	0
	.uleb128 0x7
	.uleb128 0x34
	.byte	0
	.uleb128 0x3
	.uleb128 0xe
	.uleb128 0x3a
	.uleb128 0xb
	.uleb128 0x3b
	.uleb128 0xb
	.uleb128 0x39
	.uleb128 0xb
	.uleb128 0x49
	.uleb128 0x13
	.uleb128 0x3f
	.uleb128 0x19
	.uleb128 0x3c
	.uleb128 0x19
	.byte	0
	.byte	0
	.uleb128 0x8
	.uleb128 0x21
	.byte	0
	.uleb128 0x49
	.uleb128 0x13
	.uleb128 0x2f
	.uleb128 0xb
	.byte	0
	.byte	0
	.uleb128 0x9
	.uleb128 0x24
	.byte	0
	.uleb128 0xb
	.uleb128 0xb
	.uleb128 0x3e
	.uleb128 0xb
	.uleb128 0x3
	.uleb128 0xe
	.byte	0
	.byte	0
	.uleb128 0xa
	.uleb128 0x34
	.byte	0
	.uleb128 0x47
	.uleb128 0x13
	.uleb128 0x3b
	.uleb128 0xb
	.uleb128 0x39
	.uleb128 0xb
	.uleb128 0x49
	.uleb128 0x13
	.uleb128 0x2
	.uleb128 0x18
	.byte	0
	.byte	0
	.uleb128 0xb
	.uleb128 0x2e
	.byte	0
	.uleb128 0x3f
	.uleb128 0x19
	.uleb128 0x3
	.uleb128 0xe
	.uleb128 0x3a
	.uleb128 0xb
	.uleb128 0x3b
	.uleb128 0x5
	.uleb128 0x39
	.uleb128 0xb
	.uleb128 0x27
	.uleb128 0x19
	.uleb128 0x11
	.uleb128 0x1
	.uleb128 0x12
	.uleb128 0x6
	.uleb128 0x40
	.uleb128 0x18
	.uleb128 0x2117
	.uleb128 0x19
	.byte	0
	.byte	0
	.uleb128 0xc
	.uleb128 0x2e
	.byte	0x1
	.uleb128 0x3f
	.uleb128 0x19
	.uleb128 0x3
	.uleb128 0xe
	.uleb128 0x3a
	.uleb128 0xb
	.uleb128 0x3b
	.uleb128 0x5
	.uleb128 0x39
	.uleb128 0xb
	.uleb128 0x27
	.uleb128 0x19
	.uleb128 0x11
	.uleb128 0x1
	.uleb128 0x12
	.uleb128 0x6
	.uleb128 0x40
	.uleb128 0x18
	.uleb128 0x2116
	.uleb128 0x19
	.uleb128 0x1
	.uleb128 0x13
	.byte	0
	.byte	0
	.uleb128 0xd
	.uleb128 0x34
	.byte	0
	.uleb128 0x3
	.uleb128 0xe
	.uleb128 0x3a
	.uleb128 0xb
	.uleb128 0x3b
	.uleb128 0x5
	.uleb128 0x39
	.uleb128 0xb
	.uleb128 0x49
	.uleb128 0x13
	.uleb128 0x2
	.uleb128 0x18
	.byte	0
	.byte	0
	.uleb128 0xe
	.uleb128 0x2e
	.byte	0x1
	.uleb128 0x3f
	.uleb128 0x19
	.uleb128 0x3
	.uleb128 0xe
	.uleb128 0x3a
	.uleb128 0xb
	.uleb128 0x3b
	.uleb128 0xb
	.uleb128 0x39
	.uleb128 0xb
	.uleb128 0x27
	.uleb128 0x19
	.uleb128 0x11
	.uleb128 0x1
	.uleb128 0x12
	.uleb128 0x6
	.uleb128 0x40
	.uleb128 0x18
	.uleb128 0x2117
	.uleb128 0x19
	.uleb128 0x1
	.uleb128 0x13
	.byte	0
	.byte	0
	.uleb128 0xf
	.uleb128 0x5
	.byte	0
	.uleb128 0x3
	.uleb128 0xe
	.uleb128 0x3a
	.uleb128 0xb
	.uleb128 0x3b
	.uleb128 0xb
	.uleb128 0x39
	.uleb128 0xb
	.uleb128 0x49
	.uleb128 0x13
	.uleb128 0x2
	.uleb128 0x18
	.byte	0
	.byte	0
	.uleb128 0x10
	.uleb128 0x5
	.byte	0
	.uleb128 0x3
	.uleb128 0x8
	.uleb128 0x3a
	.uleb128 0xb
	.uleb128 0x3b
	.uleb128 0xb
	.uleb128 0x39
	.uleb128 0xb
	.uleb128 0x49
	.uleb128 0x13
	.uleb128 0x2
	.uleb128 0x18
	.byte	0
	.byte	0
	.uleb128 0x11
	.uleb128 0x34
	.byte	0
	.uleb128 0x3
	.uleb128 0xe
	.uleb128 0x3a
	.uleb128 0xb
	.uleb128 0x3b
	.uleb128 0xb
	.uleb128 0x39
	.uleb128 0xb
	.uleb128 0x49
	.uleb128 0x13
	.uleb128 0x2
	.uleb128 0x18
	.byte	0
	.byte	0
	.uleb128 0x12
	.uleb128 0x2e
	.byte	0x1
	.uleb128 0x3f
	.uleb128 0x19
	.uleb128 0x3
	.uleb128 0xe
	.uleb128 0x3a
	.uleb128 0xb
	.uleb128 0x3b
	.uleb128 0xb
	.uleb128 0x39
	.uleb128 0xb
	.uleb128 0x27
	.uleb128 0x19
	.uleb128 0x11
	.uleb128 0x1
	.uleb128 0x12
	.uleb128 0x6
	.uleb128 0x40
	.uleb128 0x18
	.uleb128 0x2117
	.uleb128 0x19
	.byte	0
	.byte	0
	.byte	0
	.section	.debug_pubnames,"",%progbits
	.4byte	0x111
	.2byte	0x2
	.4byte	.Ldebug_info0
	.4byte	0x27f
	.4byte	0x6d
	.ascii	"g_pfnVectors\000"
	.4byte	0xa2
	.ascii	"IntDefaultHandler\000"
	.4byte	0xb5
	.ascii	"SysTick_Handler\000"
	.4byte	0xc8
	.ascii	"PendSV_Handler\000"
	.4byte	0xdb
	.ascii	"DebugMon_Handler\000"
	.4byte	0xee
	.ascii	"SVC_Handler\000"
	.4byte	0x101
	.ascii	"UsageFault_Handler\000"
	.4byte	0x114
	.ascii	"BusFault_Handler\000"
	.4byte	0x127
	.ascii	"MemManage_Handler\000"
	.4byte	0x13a
	.ascii	"HardFault_Handler\000"
	.4byte	0x14d
	.ascii	"NMI_Handler\000"
	.4byte	0x160
	.ascii	"ResetISR\000"
	.4byte	0x1be
	.ascii	"bss_init\000"
	.4byte	0x211
	.ascii	"data_init\000"
	.4byte	0
	.section	.debug_pubtypes,"",%progbits
	.4byte	0x1f
	.2byte	0x2
	.4byte	.Ldebug_info0
	.4byte	0x27f
	.4byte	0x66
	.ascii	"unsigned int\000"
	.4byte	0
	.section	.debug_aranges,"",%progbits
	.4byte	0x7c
	.2byte	0x2
	.4byte	.Ldebug_info0
	.byte	0x4
	.byte	0
	.2byte	0
	.2byte	0
	.4byte	.LFB0
	.4byte	.LFE0-.LFB0
	.4byte	.LFB1
	.4byte	.LFE1-.LFB1
	.4byte	.LFB2
	.4byte	.LFE2-.LFB2
	.4byte	.LFB3
	.4byte	.LFE3-.LFB3
	.4byte	.LFB4
	.4byte	.LFE4-.LFB4
	.4byte	.LFB5
	.4byte	.LFE5-.LFB5
	.4byte	.LFB6
	.4byte	.LFE6-.LFB6
	.4byte	.LFB7
	.4byte	.LFE7-.LFB7
	.4byte	.LFB8
	.4byte	.LFE8-.LFB8
	.4byte	.LFB9
	.4byte	.LFE9-.LFB9
	.4byte	.LFB10
	.4byte	.LFE10-.LFB10
	.4byte	.LFB11
	.4byte	.LFE11-.LFB11
	.4byte	.LFB12
	.4byte	.LFE12-.LFB12
	.4byte	0
	.4byte	0
	.section	.debug_ranges,"",%progbits
.Ldebug_ranges0:
	.4byte	.LFB0
	.4byte	.LFE0
	.4byte	.LFB1
	.4byte	.LFE1
	.4byte	.LFB2
	.4byte	.LFE2
	.4byte	.LFB3
	.4byte	.LFE3
	.4byte	.LFB4
	.4byte	.LFE4
	.4byte	.LFB5
	.4byte	.LFE5
	.4byte	.LFB6
	.4byte	.LFE6
	.4byte	.LFB7
	.4byte	.LFE7
	.4byte	.LFB8
	.4byte	.LFE8
	.4byte	.LFB9
	.4byte	.LFE9
	.4byte	.LFB10
	.4byte	.LFE10
	.4byte	.LFB11
	.4byte	.LFE11
	.4byte	.LFB12
	.4byte	.LFE12
	.4byte	0
	.4byte	0
	.section	.debug_macro,"",%progbits
.Ldebug_macro0:
	.2byte	0x4
	.byte	0x2
	.4byte	.Ldebug_line0
	.byte	0x7
	.4byte	.Ldebug_macro2
	.byte	0x3
	.uleb128 0
	.uleb128 0x1
	.byte	0x5
	.uleb128 0x24
	.4byte	.LASF455
	.byte	0x5
	.uleb128 0x25
	.4byte	.LASF456
	.byte	0x4
	.byte	0
