jayalcock/Clocks/1768 LPCOpen/1768 LPCOpen THUMB RAM Debug/cr_startup_lpc175x_6x.asm
	.ascii	"__ARM_EABI__ 1\000"
.LASF116:
	.ascii	"__UINT_LEAST8_MAX__ 0xff\000"
.LASF99:
	.ascii	"__INT64_MAX__ 0x7fffffffffffffffLL\000"
.LASF96:
	.ascii	"__INT8_MAX__ 0x7f\000"
.LASF265:
	.ascii	"__ULFRACT_EPSILON__ 0x1P-32ULR\000"
.LASF51:
	.ascii	"__INT_LEAST32_TYPE__ long int\000"
.LASF262:
	.ascii	"__ULFRACT_IBIT__ 0\000"
.LASF335:
	.ascii	"__UTQ_IBIT__ 0\000"
.LASF274:
	.ascii	"__ULLFRACT_MAX__ 0XFFFFFFFFFFFFFFFFP-64ULLR\000"
.LASF122:
	.ascii	"__UINT_LEAST64_MAX__ 0xffffffffffffffffULL\000"
.LASF144:
	.ascii	"__FLT_RADIX__ 2\000"
.LASF273:
	.ascii	"__ULLFRACT_MIN__ 0.0ULLR\000"
.LASF174:
	.ascii	"__DBL_HAS_QUIET_NAN__ 1\000"
.LASF293:
	.ascii	"__UACCUM_MIN__ 0.0UK\000"
.LASF260:
	.ascii	"__LFRACT_EPSILON__ 0x1P-31LR\000"
.LASF57:
	.ascii	"__INT_FAST8_TYPE__ int\000"
.LASF455:
	.ascii	"WEAK __attribute__ ((weak))\000"
.LASF219:
	.ascii	"__FLT64_HAS_INFINITY__ 1\000"
.LASF202:
	.ascii	"__FLT32_DENORM_MIN__ 1.1\000"
.LASF276:
	.ascii	"__SACCUM_FBIT__ 7\000"
.LASF34:
	.ascii	"__WCHAR_TYPE__ unsigned int\000"
.LASF200:
	.ascii	"__FLT32_MIN__ 1.1\000"
.LASF396:
	.ascii	"__ARM_ARCH_PROFILE 77\000"
.LASF439:
	.ascii	"__SIZEOF_WCHAR_T 4\000"
.LASF248:
	.ascii	"__FRACT_MIN__ (-0.5R-0.5R)\000"
.LASF366:
	.ascii	"__GCC_ATOMIC_INT_LOCK_FREE 2\000"
.LASF88:
	.ascii	"__INTMAX_MAX__ 0x7fffffffffffffffLL\000"
.LASF295:
	.ascii	"__UACCUM_EPSILON__ 0x1P-16UK\000"
.LASF287:
	.ascii	"__ACCUM_IBIT__ 16\000"
.LASF323:
	.ascii	"__DQ_IBIT__ 0\000"
.LASF211:
	.ascii	"__FLT64_MAX_10_EXP__ 308\000"
.LASF277:
	.ascii	"__SACCUM_IBIT__ 8\000"
.LASF375:
	.ascii	"__SIZEOF_PTRDIFF_T__ 4\000"
.LASF372:
	.ascii	"__PRAGMA_REDEFINE_EXTNAME 1\000"
.LASF238:
	.ascii	"__SFRACT_MIN__ (-0.5HR-0.5HR)\000"
.LASF347:
	.ascii	"__USA_IBIT__ 16\000"
.LASF426:
	.ascii	"__ARM_ARCH_EXT_IDIV__ 1\000"
.LASF380:
	.ascii	"__ARM_FEATURE_UNALIGNED 1\000"
.LASF450:
	.ascii	"__THUMB 1\000"
.LASF20:
	.ascii	"__SIZEOF_FLOAT__ 4\000"
.LASF121:
	.ascii	"__UINT32_C(c) c ## UL\000"
.LASF348:
	.ascii	"__UDA_FBIT__ 32\000"
.LASF449:
	.ascii	"__RAM_BUILD 1\000"
.LASF440:
	.ascii	"__CROSSWORKS_ARM 1\000"
.LASF467:
	.ascii	"BusFault_Handler\000"
.LASF185:
	.ascii	"__LDBL_MIN__ 1.1\000"
.LASF456:
	.ascii	"ALIAS(f) __attribute__ ((weak, alias (#f)))\000"
.LASF341:
	.ascii	"__DA_IBIT__ 32\000"
.LASF25:
	.ascii	"__BIGGEST_ALIGNMENT__ 8\000"
.LASF297:
	.ascii	"__LACCUM_IBIT__ 32\000"
.LASF244:
	.ascii	"__USFRACT_MAX__ 0XFFP-8UHR\000"
.LASF132:
	.ascii	"__UINT_FAST8_MAX__ 0xffffffffU\000"
.LASF26:
	.ascii	"__ORDER_LITTLE_ENDIAN__ 1234\000"
.LASF371:
	.ascii	"__HAVE_SPECULATION_SAFE_VALUE 1\000"
.LASF308:
	.ascii	"__LLACCUM_MIN__ (-0X1P31LLK-0X1P31LLK)\000"
.LASF338:
	.ascii	"__SA_FBIT__ 15\000"
.LASF209:
	.ascii	"__FLT64_MIN_10_EXP__ (-307)\000"
.LASF475:
	.ascii	"ResetISR\000"
.LASF280:
	.ascii	"__SACCUM_EPSILON__ 0x1P-7HK\000"
.LASF58:
	.ascii	"__INT_FAST16_TYPE__ int\000"
.LASF197:
	.ascii	"__FLT32_DECIMAL_DIG__ 9\000"
.LASF46:
	.ascii	"__UINT16_TYPE__ short unsigned int\000"
.LASF84:
	.ascii	"__WCHAR_WIDTH__ 32\000"
.LASF354:
	.ascii	"__GNUC_STDC_INLINE__ 1\000"
.LASF329:
	.ascii	"__UHQ_IBIT__ 0\000"
.LASF251:
	.ascii	"__UFRACT_FBIT__ 16\000"
.LASF390:
	.ascii	"__ARM_FEATURE_CLZ 1\000"
.LASF72:
	.ascii	"__LONG_LONG_MAX__ 0x7fffffffffffffffLL\000"
.LASF44:
	.ascii	"__INT64_TYPE__ long long int\000"
.LASF150:
	.ascii	"__FLT_MAX_10_EXP__ 38\000"
.LASF309:
	.ascii	"__LLACCUM_MAX__ 0X7FFFFFFFFFFFFFFFP-31LLK\000"
.LASF310:
	.ascii	"__LLACCUM_EPSILON__ 0x1P-31LLK\000"
.LASF283:
	.ascii	"__USACCUM_MIN__ 0.0UHK\000"
.LASF221:
	.ascii	"__FLT32X_MANT_DIG__ 53\000"
.LASF355:
	.ascii	"__NO_INLINE__ 1\000"
.LASF483:
	.ascii	"/Users/jayalcock/Projects/Clocks/Clocks/1768 LPCOpe"
	.ascii	"n/src/cr_startup_lpc175x_6x.c\000"
.LASF263:
	.ascii	"__ULFRACT_MIN__ 0.0ULR\000"
.LASF145:
	.ascii	"__FLT_MANT_DIG__ 24\000"
.LASF398:
	.ascii	"__ARM_ARCH\000"
.LASF212:
	.ascii	"__FLT64_DECIMAL_DIG__ 17\000"
.LASF352:
	.ascii	"__REGISTER_PREFIX__ \000"
.LASF193:
	.ascii	"__FLT32_MIN_EXP__ (-125)\000"
.LASF429:
	.ascii	"__ARM_FEATURE_COPROC\000"
.LASF292:
	.ascii	"__UACCUM_IBIT__ 16\000"
.LASF133:
	.ascii	"__UINT_FAST16_MAX__ 0xffffffffU\000"
.LASF62:
	.ascii	"__UINT_FAST16_TYPE__ unsigned int\000"
.LASF195:
	.ascii	"__FLT32_MAX_EXP__ 128\000"
.LASF163:
	.ascii	"__DBL_MIN_10_EXP__ (-307)\000"
.LASF282:
	.ascii	"__USACCUM_IBIT__ 8\000"
.LASF321:
	.ascii	"__SQ_IBIT__ 0\000"
.LASF67:
	.ascii	"__GXX_ABI_VERSION 1014\000"
.LASF192:
	.ascii	"__FLT32_DIG__ 6\000"
.LASF218:
	.ascii	"__FLT64_HAS_DENORM__ 1\000"
.LASF141:
	.ascii	"__FLT_EVAL_METHOD__ 0\000"
.LASF233:
	.ascii	"__FLT32X_HAS_DENORM__ 1\000"
.LASF452:
	.ascii	"__LPC17xx_SERIES 1\000"
.LASF423:
	.ascii	"__ARM_PCS 1\000"
.LASF113:
	.ascii	"__INT_LEAST64_MAX__ 0x7fffffffffffffffLL\000"
.LASF486:
	.ascii	"data_init\000"
.LASF364:
	.ascii	"__GCC_ATOMIC_WCHAR_T_LOCK_FREE 2\000"
.LASF302:
	.ascii	"__ULACCUM_IBIT__ 32\000"
.LASF266:
	.ascii	"__LLFRACT_FBIT__ 63\000"
.LASF106:
	.ascii	"__INT_LEAST8_WIDTH__ 8\000"
.LASF346:
	.ascii	"__USA_FBIT__ 16\000"
.LASF100:
	.ascii	"__UINT8_MAX__ 0xff\000"
.LASF101:
	.ascii	"__UINT16_MAX__ 0xffff\000"
.LASF448:
	.ascii	"DEBUG 1\000"
.LASF154:
	.ascii	"__FLT_MIN__ 1.1\000"
.LASF417:
	.ascii	"__ARM_FEATURE_FMA\000"
.LASF291:
	.ascii	"__UACCUM_FBIT__ 16\000"
.LASF92:
	.ascii	"__INTMAX_WIDTH__ 64\000"
.LASF431:
	.ascii	"__ARM_FEATURE_CDE\000"
.LASF256:
	.ascii	"__LFRACT_FBIT__ 31\000"
.LASF326:
	.ascii	"__UQQ_FBIT__ 8\000"
.LASF50:
	.ascii	"__INT_LEAST16_TYPE__ short int\000"
.LASF220:
	.ascii	"__FLT64_HAS_QUIET_NAN__ 1\000"
.LASF481:
	.ascii	"pulSrc\000"
.LASF445:
	.ascii	"__GNU_LINKER 1\000"
.LASF105:
	.ascii	"__INT8_C(c) c\000"
.LASF104:
	.ascii	"__INT_LEAST8_MAX__ 0x7f\000"
.LASF405:
	.ascii	"__ARM_ARCH_ISA_THUMB\000"
.LASF296:
	.ascii	"__LACCUM_FBIT__ 31\000"
.LASF171:
	.ascii	"__DBL_DENORM_MIN__ ((double)1.1)\000"
.LASF367:
	.ascii	"__GCC_ATOMIC_LONG_LOCK_FREE 2\000"
.LASF222:
	.ascii	"__FLT32X_DIG__ 15\000"
.LASF290:
	.ascii	"__ACCUM_EPSILON__ 0x1P-15K\000"
.LASF332:
	.ascii	"__UDQ_FBIT__ 64\000"
.LASF184:
	.ascii	"__LDBL_NORM_MAX__ 1.1\000"
.LASF406:
	.ascii	"__ARM_ARCH_ISA_THUMB 2\000"
.LASF334:
	.ascii	"__UTQ_FBIT__ 128\000"
.LASF153:
	.ascii	"__FLT_NORM_MAX__ 1.1\000"
.LASF24:
	.ascii	"__CHAR_BIT__ 8\000"
.LASF410:
	.ascii	"__ARM_FP\000"
.LASF137:
	.ascii	"__INTPTR_WIDTH__ 32\000"
.LASF286:
	.ascii	"__ACCUM_FBIT__ 15\000"
.LASF15:
	.ascii	"__FINITE_MATH_ONLY__ 0\000"
.LASF279:
	.ascii	"__SACCUM_MAX__ 0X7FFFP-7HK\000"
.LASF397:
	.ascii	"__arm__ 1\000"
.LASF175:
	.ascii	"__LDBL_MANT_DIG__ 53\000"
.LASF325:
	.ascii	"__TQ_IBIT__ 0\000"
.LASF344:
	.ascii	"__UHA_FBIT__ 8\000"
.LASF462:
	.ascii	"SysTick_Handler\000"
.LASF401:
	.ascii	"__GCC_ASM_FLAG_OUTPUTS__ 1\000"
.LASF438:
	.ascii	"__ELF__ 1\000"
.LASF108:
	.ascii	"__INT16_C(c) c\000"
.LASF187:
	.ascii	"__LDBL_DENORM_MIN__ 1.1\000"
.LASF453:
	.ascii	"__USE_LPCOPEN 1\000"
.LASF103:
	.ascii	"__UINT64_MAX__ 0xffffffffffffffffULL\000"
.LASF299:
	.ascii	"__LACCUM_MAX__ 0X7FFFFFFFFFFFFFFFP-31LK\000"
.LASF128:
	.ascii	"__INT_FAST32_MAX__ 0x7fffffff\000"
.LASF170:
	.ascii	"__DBL_EPSILON__ ((double)1.1)\000"
.LASF11:
	.ascii	"__ATOMIC_ACQUIRE 2\000"
.LASF458:
	.ascii	"__data_section_table\000"
.LASF430:
	.ascii	"__ARM_FEATURE_COPROC 15\000"
.LASF0:
	.ascii	"__STDC__ 1\000"
.LASF17:
	.ascii	"__SIZEOF_LONG__ 4\000"
.LASF228:
	.ascii	"__FLT32X_MAX__ 1.1\000"
.LASF164:
	.ascii	"__DBL_MAX_EXP__ 1024\000"
.LASF14:
	.ascii	"__ATOMIC_CONSUME 1\000"
.LASF129:
	.ascii	"__INT_FAST32_WIDTH__ 32\000"
.LASF436:
	.ascii	"__ARM_BF16_FORMAT_ALTERNATIVE\000"
.LASF35:
	.ascii	"__WINT_TYPE__ unsigned int\000"
.LASF71:
	.ascii	"__LONG_MAX__ 0x7fffffffL\000"
.LASF97:
	.ascii	"__INT16_MAX__ 0x7fff\000"
.LASF261:
	.ascii	"__ULFRACT_FBIT__ 32\000"
.LASF79:
	.ascii	"__SCHAR_WIDTH__ 8\000"
.LASF288:
	.ascii	"__ACCUM_MIN__ (-0X1P15K-0X1P15K)\000"
.LASF21:
	.ascii	"__SIZEOF_DOUBLE__ 8\000"
.LASF7:
	.ascii	"__GNUC_PATCHLEVEL__ 1\000"
.LASF437:
	.ascii	"__GXX_TYPEINFO_EQUALITY_INLINE 0\000"
.LASF476:
	.ascii	"bss_init\000"
.LASF249:
	.ascii	"__FRACT_MAX__ 0X7FFFP-15R\000"
.LASF76:
	.ascii	"__WINT_MIN__ 0U\000"
.LASF301:
	.ascii	"__ULACCUM_FBIT__ 32\000"
.LASF253:
	.ascii	"__UFRACT_MIN__ 0.0UR\000"
.LASF420:
	.ascii	"__ARM_NEON_FP\000"
.LASF2:
	.ascii	"__STDC_UTF_16__ 1\000"
.LASF247:
	.ascii	"__FRACT_IBIT__ 0\000"
.LASF189:
	.ascii	"__LDBL_HAS_INFINITY__ 1\000"
.LASF140:
	.ascii	"__GCC_IEC_559_COMPLEX 0\000"
.LASF102:
	.ascii	"__UINT32_MAX__ 0xffffffffUL\000"
.LASF199:
	.ascii	"__FLT32_NORM_MAX__ 1.1\000"
.LASF177:
	.ascii	"__LDBL_MIN_EXP__ (-1021)\000"
.LASF271:
	.ascii	"__ULLFRACT_FBIT__ 64\000"
.LASF373:
	.ascii	"__SIZEOF_WCHAR_T__ 4\000"
.LASF115:
	.ascii	"__INT_LEAST64_WIDTH__ 64\000"
.LASF30:
	.ascii	"__FLOAT_WORD_ORDER__ __ORDER_LITTLE_ENDIAN__\000"
.LASF289:
	.ascii	"__ACCUM_MAX__ 0X7FFFFFFFP-15K\000"
.LASF87:
	.ascii	"__SIZE_WIDTH__ 32\000"
.LASF386:
	.ascii	"__ARM_FEATURE_MVE\000"
.LASF94:
	.ascii	"__SIG_ATOMIC_MIN__ (-__SIG_ATOMIC_MAX__ - 1)\000"
.LASF270:
	.ascii	"__LLFRACT_EPSILON__ 0x1P-63LLR\000"
.LASF82:
	.ascii	"__LONG_WIDTH__ 32\000"
.LASF236:
	.ascii	"__SFRACT_FBIT__ 7\000"
.LASF39:
	.ascii	"__CHAR32_TYPE__ long unsigned int\000"
.LASF237:
	.ascii	"__SFRACT_IBIT__ 0\000"
.LASF389:
	.ascii	"__ARM_FEATURE_LDREX 7\000"
.LASF319:
	.ascii	"__HQ_IBIT__ 0\000"
.LASF353:
	.ascii	"__USER_LABEL_PREFIX__ \000"
.LASF55:
	.ascii	"__UINT_LEAST32_TYPE__ long unsigned int\000"
.LASF322:
	.ascii	"__DQ_FBIT__ 63\000"
.LASF284:
	.ascii	"__USACCUM_MAX__ 0XFFFFP-8UHK\000"
.LASF217:
	.ascii	"__FLT64_DENORM_MIN__ 1.1\000"
.LASF95:
	.ascii	"__SIG_ATOMIC_WIDTH__ 32\000"
.LASF435:
	.ascii	"__ARM_FEATURE_BF16_VECTOR_ARITHMETIC\000"
.LASF69:
	.ascii	"__SHRT_MAX__ 0x7fff\000"
.LASF413:
	.ascii	"__ARM_FP16_ARGS\000"
.LASF28:
	.ascii	"__ORDER_PDP_ENDIAN__ 3412\000"
.LASF54:
	.ascii	"__UINT_LEAST16_TYPE__ short unsigned int\000"
.LASF5:
	.ascii	"__GNUC__ 10\000"
.LASF443:
	.ascii	"__CROSSWORKS_MINOR_VERSION 8\000"
.LASF151:
	.ascii	"__FLT_DECIMAL_DIG__ 9\000"
.LASF98:
	.ascii	"__INT32_MAX__ 0x7fffffffL\000"
.LASF480:
	.ascii	"romstart\000"
.LASF85:
	.ascii	"__WINT_WIDTH__ 32\000"
.LASF471:
	.ascii	"LoadAddr\000"
.LASF255:
	.ascii	"__UFRACT_EPSILON__ 0x1P-16UR\000"
.LASF328:
	.ascii	"__UHQ_FBIT__ 16\000"
.LASF43:
	.ascii	"__INT32_TYPE__ long int\000"
.LASF224:
	.ascii	"__FLT32X_MIN_10_EXP__ (-307)\000"
.LASF434:
	.ascii	"__ARM_FEATURE_BF16_SCALAR_ARITHMETIC\000"
.LASF63:
	.ascii	"__UINT_FAST32_TYPE__ unsigned int\000"
.LASF427:
	.ascii	"__ARM_FEATURE_IDIV 1\000"
.LASF179:
	.ascii	"__LDBL_MAX_EXP__ 1024\000"
.LASF320:
	.ascii	"__SQ_FBIT__ 31\000"
.LASF306:
	.ascii	"__LLACCUM_FBIT__ 31\000"
.LASF258:
	.ascii	"__LFRACT_MIN__ (-0.5LR-0.5LR)\000"
.LASF461:
	.ascii	"IntDefaultHandler\000"
.LASF74:
	.ascii	"__WCHAR_MIN__ 0U\000"
.LASF444:
	.ascii	"__CROSSWORKS_REVISION 2\000"
.LASF120:
	.ascii	"__UINT_LEAST32_MAX__ 0xffffffffUL\000"
.LASF402:
	.ascii	"__thumb__ 1\000"
.LASF441:
	.ascii	"__HEAP_SIZE__ 128\000"
.LASF468:
	.ascii	"MemManage_Handler\000"
.LASF41:
	.ascii	"__INT8_TYPE__ signed char\000"
.LASF75:
	.ascii	"__WINT_MAX__ 0xffffffffU\000"
.LASF447:
	.ascii	"OSCILLATOR_CLOCK_FREQUENCY 12000000\000"
.LASF182:
	.ascii	"__LDBL_DECIMAL_DIG__ 17\000"
.LASF324:
	.ascii	"__TQ_FBIT__ 127\000"
.LASF245:
	.ascii	"__USFRACT_EPSILON__ 0x1P-8UHR\000"
.LASF135:
	.ascii	"__UINT_FAST64_MAX__ 0xffffffffffffffffULL\000"
.LASF134:
	.ascii	"__UINT_FAST32_MAX__ 0xffffffffU\000"
.LASF241:
	.ascii	"__USFRACT_FBIT__ 8\000"
.LASF114:
	.ascii	"__INT64_C(c) c ## LL\000"
.LASF318:
	.ascii	"__HQ_FBIT__ 15\000"
.LASF213:
	.ascii	"__FLT64_MAX__ 1.1\000"
.LASF345:
	.ascii	"__UHA_IBIT__ 8\000"
.LASF459:
	.ascii	"__data_section_table_end\000"
.LASF73:
	.ascii	"__WCHAR_MAX__ 0xffffffffU\000"
.LASF18:
	.ascii	"__SIZEOF_LONG_LONG__ 8\000"
.LASF45:
	.ascii	"__UINT8_TYPE__ unsigned char\000"
.LASF80:
	.ascii	"__SHRT_WIDTH__ 16\000"
.LASF52:
	.ascii	"__INT_LEAST64_TYPE__ long long int\000"
.LASF47:
	.ascii	"__UINT32_TYPE__ long unsigned int\000"
.LASF178:
	.ascii	"__LDBL_MIN_10_EXP__ (-307)\000"
.LASF477:
	.ascii	"start\000"
.LASF31:
	.ascii	"__SIZEOF_POINTER__ 4\000"
.LASF294:
	.ascii	"__UACCUM_MAX__ 0XFFFFFFFFP-16UK\000"
.LASF409:
	.ascii	"__VFP_FP__ 1\000"
.LASF264:
	.ascii	"__ULFRACT_MAX__ 0XFFFFFFFFP-32ULR\000"
.LASF336:
	.ascii	"__HA_FBIT__ 7\000"
.LASF86:
	.ascii	"__PTRDIFF_WIDTH__ 32\000"
.LASF190:
	.ascii	"__LDBL_HAS_QUIET_NAN__ 1\000"
.LASF278:
	.ascii	"__SACCUM_MIN__ (-0X1P7HK-0X1P7HK)\000"
.LASF81:
	.ascii	"__INT_WIDTH__ 32\000"
.LASF370:
	.ascii	"__GCC_ATOMIC_POINTER_LOCK_FREE 2\000"
.LASF123:
	.ascii	"__UINT64_C(c) c ## ULL\000"
.LASF300:
	.ascii	"__LACCUM_EPSILON__ 0x1P-31LK\000"
.LASF463:
	.ascii	"PendSV_Handler\000"
.LASF240:
	.ascii	"__SFRACT_EPSILON__ 0x1P-7HR\000"
.LASF473:
	.ascii	"SectionLen\000"
.LASF327:
	.ascii	"__UQQ_IBIT__ 0\000"
.LASF330:
	.ascii	"__USQ_FBIT__ 32\000"
.LASF337:
	.ascii	"__HA_IBIT__ 8\000"
.LASF457:
	.ascii	"g_pfnVectors\000"
.LASF363:
	.ascii	"__GCC_ATOMIC_CHAR32_T_LOCK_FREE 2\000"
.LASF1:
	.ascii	"__STDC_VERSION__ 199901L\000"
.LASF422:
	.ascii	"__ARM_ARCH_7M__ 1\000"
.LASF156:
	.ascii	"__FLT_DENORM_MIN__ 1.1\000"
.LASF23:
	.ascii	"__SIZEOF_SIZE_T__ 4\000"
.LASF250:
	.ascii	"__FRACT_EPSILON__ 0x1P-15R\000"
.LASF4:
	.ascii	"__STDC_HOSTED__ 1\000"
.LASF136:
	.ascii	"__INTPTR_MAX__ 0x7fffffff\000"
.LASF169:
	.ascii	"__DBL_MIN__ ((double)1.1)\000"
.LASF408:
	.ascii	"__SOFTFP__ 1\000"
.LASF229:
	.ascii	"__FLT32X_NORM_MAX__ 1.1\000"
.LASF368:
	.ascii	"__GCC_ATOMIC_LLONG_LOCK_FREE 1\000"
.LASF359:
	.ascii	"__GCC_HAVE_SYNC_COMPARE_AND_SWAP_4 1\000"
.LASF149:
	.ascii	"__FLT_MAX_EXP__ 128\000"
.LASF13:
	.ascii	"__ATOMIC_ACQ_REL 4\000"
.LASF64:
	.ascii	"__UINT_FAST64_TYPE__ long long unsigned int\000"
.LASF37:
	.ascii	"__UINTMAX_TYPE__ long long unsigned int\000"
.LASF466:
	.ascii	"UsageFault_Handler\000"
.LASF65:
	.ascii	"__INTPTR_TYPE__ int\000"
.LASF143:
	.ascii	"__DEC_EVAL_METHOD__ 2\000"
.LASF201:
	.ascii	"__FLT32_EPSILON__ 1.1\000"
.LASF242:
	.ascii	"__USFRACT_IBIT__ 0\000"
.LASF112:
	.ascii	"__INT_LEAST32_WIDTH__ 32\000"
.LASF376:
	.ascii	"__ARM_FEATURE_DSP\000"
.LASF8:
	.ascii	"__VERSION__ \"10.3.1 20210621 (release)\"\000"
.LASF395:
	.ascii	"__ARM_ARCH_PROFILE\000"
.LASF470:
	.ascii	"NMI_Handler\000"
.LASF446:
	.ascii	"__TARGET_PROCESSOR LPC1768\000"
.LASF32:
	.ascii	"__SIZE_TYPE__ unsigned int\000"
.LASF451:
	.ascii	"USE_PROCESS_STACK 1\000"
.LASF311:
	.ascii	"__ULLACCUM_FBIT__ 32\000"
.LASF208:
	.ascii	"__FLT64_MIN_EXP__ (-1021)\000"
.LASF246:
	.ascii	"__FRACT_FBIT__ 15\000"
.LASF365:
	.ascii	"__GCC_ATOMIC_SHORT_LOCK_FREE 2\000"
.LASF351:
	.ascii	"__UTA_IBIT__ 64\000"
.LASF148:
	.ascii	"__FLT_MIN_10_EXP__ (-37)\000"
.LASF223:
	.ascii	"__FLT32X_MIN_EXP__ (-1021)\000"
.LASF142:
	.ascii	"__FLT_EVAL_METHOD_TS_18661_3__ 0\000"
.LASF173:
	.ascii	"__DBL_HAS_INFINITY__ 1\000"
.LASF167:
	.ascii	"__DBL_MAX__ ((double)1.1)\000"
.LASF59:
	.ascii	"__INT_FAST32_TYPE__ int\000"
.LASF159:
	.ascii	"__FLT_HAS_QUIET_NAN__ 1\000"
.LASF16:
	.ascii	"__SIZEOF_INT__ 4\000"
.LASF36:
	.ascii	"__INTMAX_TYPE__ long long int\000"
.LASF484:
	.ascii	"/Users/jayalcock/Projects/Clocks/Clocks/1768 LPCOpe"
	.ascii	"n\000"
.LASF89:
	.ascii	"__INTMAX_C(c) c ## LL\000"
.LASF415:
	.ascii	"__ARM_FEATURE_FP16_VECTOR_ARITHMETIC\000"
.LASF400:
	.ascii	"__APCS_32__ 1\000"
.LASF216:
	.ascii	"__FLT64_EPSILON__ 1.1\000"
.LASF48:
	.ascii	"__UINT64_TYPE__ long long unsigned int\000"
.LASF235:
	.ascii	"__FLT32X_HAS_QUIET_NAN__ 1\000"
.LASF165:
	.ascii	"__DBL_MAX_10_EXP__ 308\000"
.LASF474:
	.ascii	"SectionTableAddr\000"
.LASF214:
	.ascii	"__FLT64_NORM_MAX__ 1.1\000"
.LASF361:
	.ascii	"__GCC_ATOMIC_CHAR_LOCK_FREE 2\000"
.LASF343:
	.ascii	"__TA_IBIT__ 64\000"
.LASF316:
	.ascii	"__QQ_FBIT__ 7\000"
.LASF469:
	.ascii	"HardFault_Handler\000"
.LASF234:
	.ascii	"__FLT32X_HAS_INFINITY__ 1\000"
.LASF125:
	.ascii	"__INT_FAST8_WIDTH__ 32\000"
.LASF147:
	.ascii	"__FLT_MIN_EXP__ (-125)\000"
.LASF433:
	.ascii	"__ARM_FEATURE_MATMUL_INT8\000"
.LASF181:
	.ascii	"__DECIMAL_DIG__ 17\000"
.LASF421:
	.ascii	"__THUMB_INTERWORK__ 1\000"
.LASF111:
	.ascii	"__INT32_C(c) c ## L\000"
.LASF412:
	.ascii	"__ARM_FP16_FORMAT_ALTERNATIVE\000"
.LASF482:
	.ascii	"GNU C99 10.3.1 20210621 (release) -fmessage-length="
	.ascii	"0 -std=gnu99 -mcpu=cortex-m3 -mlittle-endian -mfloa"
	.ascii	"t-abi=soft -mthumb -mtp=soft -munaligned-access -fm"
	.ascii	"s-extensions -g3 -gpubnames -fomit-frame-pointer -f"
	.ascii	"no-dwarf2-cfi-asm -ffunction-sections -fdata-sectio"
	.ascii	"ns -fshort-enums -fno-common\000"
.LASF180:
	.ascii	"__LDBL_MAX_10_EXP__ 308\000"
.LASF226:
	.ascii	"__FLT32X_MAX_10_EXP__ 308\000"
.LASF138:
	.ascii	"__UINTPTR_MAX__ 0xffffffffU\000"
.LASF172:
	.ascii	"__DBL_HAS_DENORM__ 1\000"
.LASF382:
	.ascii	"__ARM_FEATURE_CRC32\000"
.LASF196:
	.ascii	"__FLT32_MAX_10_EXP__ 38\000"
.LASF378:
	.ascii	"__ARM_FEATURE_SAT 1\000"
.LASF259:
	.ascii	"__LFRACT_MAX__ 0X7FFFFFFFP-31LR\000"
.LASF460:
	.ascii	"__bss_section_table_end\000"
.LASF404:
	.ascii	"__THUMBEL__ 1\000"
.LASF110:
	.ascii	"__INT_LEAST32_MAX__ 0x7fffffffL\000"
.LASF183:
	.ascii	"__LDBL_MAX__ 1.1\000"
.LASF90:
	.ascii	"__UINTMAX_MAX__ 0xffffffffffffffffULL\000"
.LASF40:
	.ascii	"__SIG_ATOMIC_TYPE__ int\000"
.LASF268:
	.ascii	"__LLFRACT_MIN__ (-0.5LLR-0.5LLR)\000"
.LASF215:
	.ascii	"__FLT64_MIN__ 1.1\000"
.LASF275:
	.ascii	"__ULLFRACT_EPSILON__ 0x1P-64ULLR\000"
.LASF188:
	.ascii	"__LDBL_HAS_DENORM__ 1\000"
.LASF118:
	.ascii	"__UINT_LEAST16_MAX__ 0xffff\000"
.LASF388:
	.ascii	"__ARM_FEATURE_LDREX\000"
.LASF161:
	.ascii	"__DBL_DIG__ 15\000"
.LASF281:
	.ascii	"__USACCUM_FBIT__ 8\000"
.LASF157:
	.ascii	"__FLT_HAS_DENORM__ 1\000"
.LASF131:
	.ascii	"__INT_FAST64_WIDTH__ 64\000"
.LASF166:
	.ascii	"__DBL_DECIMAL_DIG__ 17\000"
	.ident	"GCC: (based on arm-10.3-2021.07 GCC) 10.3.1 20210621 (release)"
